fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/ВКМ_НачисленияЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачисленияЗарплаты</name>
  <registerRecords>CalculationRegister.ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикиРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Удержания</types>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ВКМ_ГрафикиРабот/ВКМ_ГрафикиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_ГрафикиРабот</name>
  <tabularSections>
    <name>ГрафикиПоМесяцам</name>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочихДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

fonecmid-diplom/src/Catalogs/ВКМ_ФизическиеЛица/ВКМ_ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_ФизическиеЛица</name>
  <attributes>
    <name>ТарифнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидТарифнойСтавки</name>
    <type>
      <types>EnumRef.ВидыТарифныхСтавок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРабот</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	


КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте                  
Процедура Заполнить(Команда)
   ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) тогда
		ОбщегоНазначения.СообщитьПользователю("Заполните организацию");
		возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Период) тогда
		ОбщегоНазначения.СообщитьПользователю("Заполните период расчета");
		возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	      "ВЫБРАТЬ
	      |	ВКМ_ГрафикиРаботГрафикиПоМесяцам.Ссылка КАК Ссылка,
	      |	ВКМ_ГрафикиРаботГрафикиПоМесяцам.Месяц КАК Месяц,
	      |	ВКМ_ГрафикиРаботГрафикиПоМесяцам.РабочихДней КАК РабочихДней
	      |ПОМЕСТИТЬ Графики
	      |ИЗ
	      |	Справочник.ВКМ_ГрафикиРабот.ГрафикиПоМесяцам КАК ВКМ_ГрафикиРаботГрафикиПоМесяцам
	      |ГДЕ
	      |	ВКМ_ГрафикиРаботГрафикиПоМесяцам.Месяц = &ДатаНачала
	      |;
	      |
	      |////////////////////////////////////////////////////////////////////////////////
	      |ВЫБРАТЬ
	      |	ВКМ_ФизическиеЛица.Ссылка КАК Ссылка,
	      |	ВКМ_ФизическиеЛица.ТарифнаяСтавка КАК ТарифнаяСтавка,
	      |	ВКМ_ФизическиеЛица.Наименование КАК Наименование,
	      |	ВКМ_ФизическиеЛица.Должность КАК Должность,
	      |	ВКМ_ФизическиеЛица.ВидТарифнойСтавки КАК ВидТарифнойСтавки,
	      |	ВЫБОР
	      |		КОГДА ВКМ_ФизическиеЛица.ДатаПриема <= &ДатаНачала
	      |			ТОГДА &ДатаНачала
	      |		ИНАЧЕ ВКМ_ФизическиеЛица.ДатаПриема
	      |	КОНЕЦ КАК ДатаНачала,
	      |	ВЫБОР
	      |		КОГДА ВКМ_ФизическиеЛица.ДатаУвольнения >= &ДатаОкончания
	      |				ИЛИ ВКМ_ФизическиеЛица.ДатаУвольнения = &ПустаяДата
	      |			ТОГДА &ДатаОкончания
	      |		ИНАЧЕ ВКМ_ФизическиеЛица.ДатаУвольнения
	      |	КОНЕЦ КАК ДатаОкончания,
	      |	Графики.РабочихДней КАК РабочихДней,
	      |	ВКМ_ФизическиеЛица.ГрафикРабот КАК ГрафикРабот
	      |ИЗ
	      |	Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица
	      |		ЛЕВОЕ СОЕДИНЕНИЕ Графики КАК Графики
	      |		ПО ВКМ_ФизическиеЛица.ГрафикРабот = Графики.Ссылка
	      |ГДЕ
	      |	ВКМ_ФизическиеЛица.ДатаПриема <= &ДатаОкончания
	      |	И (ВКМ_ФизическиеЛица.ДатаУвольнения >= &ДатаНачала
	      |			ИЛИ ВКМ_ФизическиеЛица.ДатаУвольнения = &ПустаяДата)
	      |	И ВКМ_ФизическиеЛица.Организация = &Организация";
	      
	Запрос.УстановитьПараметр("ПустаяДата",Дата('00010101'));
	Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Объект.Период));
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Объект.Начисления.Очистить();
		
	Для Каждого стр из РезультатЗапроса Цикл
		 НоваяСтрока = Объект.Начисления.Добавить();
		 НоваяСтрока.Сотрудник = стр.Ссылка;
		 НоваяСтрока.Организация = Объект.Организация;
		 НоваяСтрока.ДатаНачала	= стр.ДатаНачала;
		 НоваяСтрока.ДатаОкончания	= стр.ДатаОкончания;
		 НоваяСтрока.ГрафикРаботы =  стр.ГрафикРабот;
		 НоваяСтрока.ДнейПоГрафику = стр.РабочихДней;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Дата = ТекущаяДата();
	Объект.Период = НачалоМесяца(НачалоМесяца(ТекущаяДата())-86400);
КонецПроцедуры

&НаСервере
Процедура РассчитатьНаСервере()
	Для каждого стр из Объект.Начисления Цикл    
		Если ЗначениеЗаполнено(стр.ДнейПоГрафику) и ЗначениеЗаполнено(стр.Дней) тогда
		  	Стр.Результат = Окр(стр.Сотрудник.ТарифнаяСтавка/стр.ДнейПоГрафику*стр.Дней,2); 
			Стр.НДФЛ =  Окр(Стр.Результат*0.13,2);
			стр.КВыплате = Стр.Результат-Стр.НДФЛ;
		иначе 
			ОбщегоНазначения.СообщитьПользователю("Заполните	дни");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры
